Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Увольнение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеУдержания</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеУдержания</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияРаботников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Увольнение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РаботникиОрганизаций.Очистить();
	Движения.РаботникиОрганизаций.Записать();
	
	//Ресурсы = ПроверкаДокументов.ПолучитьРесурсыСотрудника(Сотрудник, Подразделение, МоментВремени());
	//
	//Если Ресурсы.Состояние<>Перечисления.СостоянияРаботников.Работает Тогда
	//              
	//	Сообщить("Сотрудник здесь не работает");
	//	Отказ = Истина;
	//	Возврат;
	//
	//КонецЕсли; 
	// регистр РаботникиОрганизаций
	Движения.РаботникиОрганизаций.Записывать = Истина;
	Движения.ПлановыеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	Движение = Движения.РаботникиОрганизаций.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Подразделение = Подразделение;
	Движение.Состояние = Перечисления.СостоянияРаботников.Уволен;


	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПлановыеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета
	//	|ИЗ
	//	|	РегистрСведений.ПлановыеНачисления.СрезПоследних(
	//	|			&Момент,
	//	|			Сотрудник = &Сотрудник
	//	|				И Подразделение = &Подразделение) КАК ПлановыеНачисленияСрезПоследних
	//	|ГДЕ
	//	|	ПлановыеНачисленияСрезПоследних.Значение <> 0
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПлановыеУдержанияСрезПоследних.ВидРасчета
	//	|ИЗ
	//	|	РегистрСведений.ПлановыеУдержания.СрезПоследних(
	//	|			&Момент,
	//	|			Сотрудник = &Сотрудник
	//	|				И Подразделение = &Подразделение) КАК ПлановыеУдержанияСрезПоследних
	//	|ГДЕ
	//	|	ПлановыеУдержанияСрезПоследних.Значение <> 0";

	//Запрос.УстановитьПараметр("Момент", МоментВремени());
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда
	//	
	//		Запись = Движения.ПлановыеНачисления.Добавить();
	//		
	//	ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
	//		
	//		Запись = Движения.ПлановыеУдержания.Добавить();
	//		
	//	Иначе
	//		
	//		Сообщить("Странный ВР");
	//		Продолжить;
	//	
	//	КонецЕсли; 
	//	
	//	Запись.Период = Дата;
	//	Запись.Сотрудник = Сотрудник;
	//	Запись.Подразделение = Подразделение;
	//	Запись.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
	//	Запись.Значение = 0;
	//	
	//КонецЦикла;	
	
	
	//
	Движения.ПлановыеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Дата", Дата);
	ДанныеДокумента.Вставить("Сотрудник", Сотрудник);
	ДанныеДокумента.Вставить("Подразделение", Подразделение);
	ДанныеДокумента.Вставить("МоментВремени", МоментВремени());
	
	КадровыйУчет.ОбнулитьПлановыеНачисленияУдержания(ДанныеДокумента, Движения);
	//

КонецПроцедуры
